In [3]:
import findspark
parkpath="/home/soyoung/newSparkJune2018/spark-2.3.0-bin-hadoop2.7/"
findspark.init(parkpath)

import pyspark
import os

In [4]:
os.chdir('/home/soyoung/newSparkJune2018/exerciseData/')

In [5]:
%%time
sc=pyspark.SparkContext()

CPU times: user 4 ms, sys: 16 ms, total: 20 ms
Wall time: 2.75 s

In [6]:
data=sc.textFile('./06_02 commands.txt')

In [7]:
data.count()

26

In [8]:
data.collect()[:2]

[u'For Mac:', u'']

In [9]:
data.first()

u'For Mac:'

In [10]:
data.take(3)

[u'For Mac:',
 u'',
 u'1) Set path for Spark and adjust to the correct path to Spark']

___

In [11]:
!pwd

/home/soyoung/newSparkJune2018/exerciseData

In [12]:
!ls

06_02 commands.txt    __MACOSX		   cogsley_sales.csv  sales_log.zip
Spark Essentials.dbc  cogsley_clients.csv  sales_log	      state_info.csv

In [14]:
logpath="./sales_log/"

In [18]:
log7=sc.wholeTextFiles(logpath+'sales-7*.csv')
log7.count()

11

In [62]:
len(log7.first())

2

In [22]:
sc.version

u'2.3.0'

In [27]:
log7.toDF()

AttributeError: 'RDD' object has no attribute 'toDF'

In [29]:
from pyspark.sql import SparkSession
spark = SparkSession(sc)

In [31]:
log7df = log7.toDF(['path','data'])
log7df

DataFrame[path: string, data: string]

In [32]:
log7df.show()

+--------------------+--------------------+
|                path|                data|
+--------------------+--------------------+
|file:/home/soyoun...|52007,4/14/12,25,...|
|file:/home/soyoun...|47846,8/11/12,5,0...|
|file:/home/soyoun...|134,4/30/12,11,0....|
|file:/home/soyoun...|29221,5/29/12,41,...|
|file:/home/soyoun...|15399,5/13/12,7,0...|
|file:/home/soyoun...|5509,4/7/09,21,0....|
|file:/home/soyoun...|29893,6/16/12,24,...|
|file:/home/soyoun...|23174,7/26/12,8,0...|
|file:/home/soyoun...|52676,8/28/12,46,...|
|file:/home/soyoun...|4996,9/13/12,30,0...|
|file:/home/soyoun...|24450,7/9/12,37,0...|
+--------------------+--------------------+

In [33]:
log7df.toPandas()

,path,data
0,file:/home/soyoung/newSparkJune2018/exerciseDa...,"52007,4/14/12,25,0.1,200,4593.41,Alejandro Ols..."
1,file:/home/soyoung/newSparkJune2018/exerciseDa...,"47846,8/11/12,5,0.01,125,633.43,Hilary Vittori..."
2,file:/home/soyoung/newSparkJune2018/exerciseDa...,"134,4/30/12,11,0.01,200,2224.08,Michael Olson,..."
3,file:/home/soyoung/newSparkJune2018/exerciseDa...,"29221,5/29/12,41,0,110,4608.67,Jay O'Donnell,C..."
4,file:/home/soyoung/newSparkJune2018/exerciseDa...,"15399,5/13/12,7,0.01,125,884.86,Benjamin Schmi..."
5,file:/home/soyoung/newSparkJune2018/exerciseDa...,"5509,4/7/09,21,0.03,125,2529.2,Ashley Wiener,A..."
6,file:/home/soyoung/newSparkJune2018/exerciseDa...,"29893,6/16/12,24,0.07,200,4563.66,Michael Darl..."
7,file:/home/soyoung/newSparkJune2018/exerciseDa...,"23174,7/26/12,8,0.03,200,1588.19,Harry Kotsoni..."
8,file:/home/soyoung/newSparkJune2018/exerciseDa...,"52676,8/28/12,46,0.01,110,5130.34,Amy Murray,T..."
9,file:/home/soyoung/newSparkJune2018/exerciseDa...,"4996,9/13/12,30,0,200,6147.24,Rob Sissman,Mich..."
10,file:/home/soyoung/newSparkJune2018/exerciseDa...,"24450,7/9/12,37,0.02,170,6305.34,Kristina Will..."

___

In [34]:
logs2=sc.textFile(logpath+'sales-2*.csv')
logs2.count()

1100

In [36]:
logs2.first()

u'25541,1/13/09,50,0.07,110,5070.06,Mike Daniels,Florida,South,Development - Python,1,0.54'

___
* sql
* csv

In [38]:
spark

In [39]:
logdf = spark.read.csv(logpath, inferSchema=True)
logdf

DataFrame[_c0: int, _c1: string, _c2: int, _c3: double, _c4: int, _c5: double, _c6: string, _c7: string, _c8: string, _c9: string, _c10: int, _c11: double]

In [40]:
logdf.count()

8399

In [41]:
logdf.show()

+-----+--------+---+----+---+-------+------------------+-----------+-------+--------------------+----+----+
|  _c0|     _c1|_c2| _c3|_c4|    _c5|               _c6|        _c7|    _c8|                 _c9|_c10|_c11|
+-----+--------+---+----+---+-------+------------------+-----------+-------+--------------------+----+----+
|44935|11/17/10| 37|0.06|200| 7011.4|     Arthur Nelson| New Mexico|   West| Development - Scala|   1|0.65|
|44935|11/17/10| 37|0.01|140|5169.04|     Arthur Nelson|    Florida|  South|Development - Dat...|   1|0.64|
| 2563|11/18/10| 12|0.04|200|2322.41| Brenda Hildebrand|Mississippi|  South| Development - Scala|   1|0.74|
| 2563|11/18/10| 33|0.01|120|3951.72| Brenda Hildebrand|Mississippi|  South|Development - Bus...|   1|0.44|
| 2752|11/18/10| 30|0.03|150|4399.87|     Todd Cacioppo|  Wisconsin|Central|Consulting - Busi...|   1|0.53|
| 2752|11/18/10| 41|0.02|140|5670.14|     Todd Cacioppo|  Wisconsin|Central|Development - Dat...|   1|0.56|
| 2752|11/18/10| 10|0.03|200| 1955.5|     Todd Cacioppo|  Wisconsin|Central|Development - Big...|   1|0.69|
| 2752|11/18/10| 10|0.04|150| 1451.5|     Todd Cacioppo|  Wisconsin|Central|Consulting - Mark...|   1| 0.7|
|13607|11/18/10| 12|0.07|150|1687.37|     Matthew Lucas| New Mexico|   West|Consulting - Busi...|   1|0.59|
|13607|11/18/10| 37|0.09|200| 6787.8|     Matthew Lucas| New Mexico|   West| Development - Scala|   1|0.74|
|13607|11/18/10| 13| 0.0|200|2620.77|     Matthew Lucas| New Mexico|   West|Development - Big...|   1|0.72|
|22887|11/18/10| 34|0.07|125|3984.08|     Eugene Liston|   Kentucky|  South|Training - Develo...|   1|0.54|
|34658|11/18/10| 33|0.05|125|3950.06|         Alan Daly|      Texas|Central|  Training - Tableau|   1|0.58|
| 8001|11/19/10| 15| 0.1|110| 1496.9|    Charles Sunley| California|   West|Development - Python|   1|0.38|
| 8001|11/19/10| 47|0.01|200|9380.58|    Charles Sunley| California|   West|Development - Big...|   1|0.74|
|23366|11/19/10| 12|0.06|125| 1421.3|      Tim Swindell| California|   West|      Training - SQL|   1|0.43|
|23366|11/19/10|  5|0.04|200| 967.69|      Tim Swindell| California|   West|Development - Big...|   1|0.67|
|45190|11/19/10| 13| 0.0|125|1638.02|     George Barnes|      Texas|Central|Training - Develo...|   1|0.58|
| 8582|11/20/10| 15|0.04|125|1814.47|     David Glassco| California|   West|      Training - SQL|   1| 0.5|
|13895|11/20/10| 44|0.02|200|8693.33|Michelle Collister|  Wisconsin|Central|Development - Big...|   1|0.65|
+-----+--------+---+----+---+-------+------------------+-----------+-------+--------------------+----+----+
only showing top 20 rows

___

In [42]:
df = spark.read.csv('./cogsley_clients.csv', inferSchema=True, header=True)
df

DataFrame[Name: string, Symbol: string, LastSale: string, MarketCapLabel: string, MarketCapAmount: string, IPOyear: string, Sector: string, industry: string, Summary Quote: string]

In [44]:
df.show(3)

+------------------+------+--------+--------------+---------------+-------+-------+-----------------+--------------------+
|              Name|Symbol|LastSale|MarketCapLabel|MarketCapAmount|IPOyear| Sector|         industry|       Summary Quote|
+------------------+------+--------+--------------+---------------+-------+-------+-----------------+--------------------+
|1347 Capital Corp.|  TFSC|    9.43|       $56.09M|       56090000|   2014|Finance|Business Services|http://www.nasdaq...|
|1347 Capital Corp.| TFSCR|    0.37|           n/a|              0|   2014|Finance|Business Services|http://www.nasdaq...|
|1347 Capital Corp.| TFSCU|    9.97|       $41.67M|       41670000|   2014|    n/a|              n/a|http://www.nasdaq...|
+------------------+------+--------+--------------+---------------+-------+-------+-----------------+--------------------+
only showing top 3 rows

In [47]:
df.toPandas().head(5)

,Name,Symbol,LastSale,MarketCapLabel,MarketCapAmount,IPOyear,Sector,industry,Summary Quote
0,1347 Capital Corp.,TFSC,9.43,$56.09M,56090000,2014,Finance,Business Services,http://www.nasdaq.com/symbol/tfsc
1,1347 Capital Corp.,TFSCR,0.37,n/a,0,2014,Finance,Business Services,http://www.nasdaq.com/symbol/tfscr
2,1347 Capital Corp.,TFSCU,9.97,$41.67M,41670000,2014,n/a,n/a,http://www.nasdaq.com/symbol/tfscu
3,1347 Capital Corp.,TFSCW,0.2,n/a,0,2014,Finance,Business Services,http://www.nasdaq.com/symbol/tfscw
4,"1347 Property Insurance Holdings, Inc.",PIH,7.66,$48.7M,48700000,2014,Finance,Property-Casualty Insurers,http://www.nasdaq.com/symbol/pih

In [49]:
df.createTempView?

In [50]:
df.registerTempTable?

In [51]:
df.write.saveAsTable?

In [63]:
df.createTempView('clients')

In [64]:
spark.sql('select name, lastsale from clients').show()

+--------------------+--------+
|                name|lastsale|
+--------------------+--------+
|  1347 Capital Corp.|    9.43|
|  1347 Capital Corp.|    0.37|
|  1347 Capital Corp.|    9.97|
|  1347 Capital Corp.|     0.2|
|1347 Property Ins...|    7.66|
|1-800 FLOWERS.COM...|   10.32|
|1st Century Bancs...|   6.774|
|1st Constitution ...|   11.18|
|1st Source Corpor...|   31.31|
|21Vianet Group, Inc.|   18.33|
|            2U, Inc.|   17.62|
|3X Inverse Gold E...|   72.22|
|         51job, Inc.|   33.77|
|6D Global Technol...|    8.52|
|             8x8 Inc|    7.62|
|     A V Homes, Inc.|   15.13|
|   A. Schulman, Inc.|    40.3|
|          AAON, Inc.|   23.74|
|        ABAXIS, Inc.|   60.17|
|   Abengoa Yield plc|   34.73|
+--------------------+--------+
only showing top 20 rows

### create table using SQL

In [56]:
spark.sql('''
CREATE TABLE IF NOT EXISTS sales
USING CSV
OPTIONS (path "/home/soyoung/newSparkJune2018/exerciseData/cogsley_sales.csv", header "true", inferSchema "true")
''')

DataFrame[]

In [65]:
spark.sql('show tables').show()

+--------+---------+-----------+
|database|tableName|isTemporary|
+--------+---------+-----------+
| default|    sales|      false|
|        |  clients|       true|
|        |  tmpview|       true|
+--------+---------+-----------+

In [69]:
import pandas as pd
pd.options.display.max_columns=100

In [70]:
spark.sql('select * from sales limit 5').toPandas()

,RowID,OrderID,OrderDate,OrderMonthYear,Quantity,Quote,DiscountPct,Rate,SaleAmount,CustomerName,CompanyName,Sector,Industry,City,ZipCode,State,Region,ProjectCompleteDate,DaystoComplete,ProductKey,ProductCategory,ProductSubCategory,Consultant,Manager,HourlyWage,RowCount,WageMargin
0,1,3,2010-10-13,2010-10-01,6,1200,0.04,200,1152.0,Muhammed MacIntyre,CA Inc.,Technology,Computer Software: Prepackaged Software,Highland Park,60035,Illinois,Central,2010-10-20,7,Development - Big Data,Development,Big Data,Ethan Bird,Josh Martinez,60,1,0.70
1,2,6,2012-02-20,2012-02-01,2,280,0.01,140,277.2,Ruben Staebel,Celgene Corporation,Health Care,Major Pharmaceuticals,Edmonds,98026,Washington,West,2012-02-21,1,Development - Front End Web,Development,Front End Web,Isabella Douglas,Bob Turner,75,1,0.46
2,3,32,2011-07-15,2011-07-01,26,3250,0.07,125,3022.5,Liz Greer,"Twenty-First Century Fox, Inc.",Consumer Services,Television Services,Elk Plain,98387,Washington,West,2011-07-17,2,Training - SQL,Training,SQL,Isabella Douglas,Bob Turner,75,1,0.40
3,4,32,2011-07-15,2011-07-01,24,3000,0.09,125,2730.0,Liz Greer,"Twenty-First Century Fox, Inc.",Consumer Services,Television Services,Elk Plain,98387,Washington,West,2011-07-16,1,Training - Javascript,Training,Javascript,Olivia Sullivan,Bob Turner,53,1,0.58
4,5,32,2011-07-15,2011-07-01,23,3450,0.04,150,3312.0,Liz Greer,"Twenty-First Century Fox, Inc.",Consumer Services,Television Services,Elk Plain,98387,Washington,West,2011-07-17,2,Consulting - Market Research,Consulting,Market Research,Abigail Young,Bob Turner,50,1,0.67

In [66]:
spark.sql('select * from clients limit 5').toPandas()

,Name,Symbol,LastSale,MarketCapLabel,MarketCapAmount,IPOyear,Sector,industry,Summary Quote
0,1347 Capital Corp.,TFSC,9.43,$56.09M,56090000,2014,Finance,Business Services,http://www.nasdaq.com/symbol/tfsc
1,1347 Capital Corp.,TFSCR,0.37,n/a,0,2014,Finance,Business Services,http://www.nasdaq.com/symbol/tfscr
2,1347 Capital Corp.,TFSCU,9.97,$41.67M,41670000,2014,n/a,n/a,http://www.nasdaq.com/symbol/tfscu
3,1347 Capital Corp.,TFSCW,0.2,n/a,0,2014,Finance,Business Services,http://www.nasdaq.com/symbol/tfscw
4,"1347 Property Insurance Holdings, Inc.",PIH,7.66,$48.7M,48700000,2014,Finance,Property-Casualty Insurers,http://www.nasdaq.com/symbol/pih

In [72]:
joinedQuery = spark.sql('''select CompanyName, IPOYear, Symbol, round(sum(SaleAmount)) as Sales
                        from sales s join clients c on s.CompanyName = c.Name
                        group by CompanyName, IPOYear, Symbol
                        order by 1''')
joinedQuery

DataFrame[CompanyName: string, IPOYear: string, Symbol: string, Sales: double]

In [74]:
joineddf = joinedQuery.toPandas()
joineddf.tail()

                  CompanyName IPOYear Symbol     Sales
109  Whole Foods Market, Inc.     n/a    WFM  298207.0
110     Wynn Resorts, Limited    2002   WYNN  198158.0
111              Xilinx, Inc.    1990   XLNX  217586.0
112               Yahoo! Inc.    1996   YHOO  265540.0
113                 eBay Inc.    1998   EBAY  285432.0

___
* add state data

In [75]:
state = spark.read.csv('./state_info.csv', inferSchema=True, header=True)
state

DataFrame[State: string, StateCode: string, Capital: string, LargestCity: string, PopulationEst2015: int, HouseSeats: int, StateHood: timestamp]

In [78]:
state.count()

50

In [77]:
state.show(3)

+-------+---------+----------+-----------+-----------------+----------+-------------------+
|  State|StateCode|   Capital|LargestCity|PopulationEst2015|HouseSeats|          StateHood|
+-------+---------+----------+-----------+-----------------+----------+-------------------+
|Alabama|       AL|Montgomery| Birmingham|          4858979|         7|1819-12-14 00:00:00|
| Alaska|       AK|    Juneau|  Anchorage|           738432|         1|1959-01-03 00:00:00|
|Arizona|       AZ|   Phoenix|    Phoenix|          6828065|         9|1912-02-14 00:00:00|
+-------+---------+----------+-----------+-----------------+----------+-------------------+
only showing top 3 rows

In [79]:
state.printSchema()

root
 |-- State: string (nullable = true)
 |-- StateCode: string (nullable = true)
 |-- Capital: string (nullable = true)
 |-- LargestCity: string (nullable = true)
 |-- PopulationEst2015: integer (nullable = true)
 |-- HouseSeats: integer (nullable = true)
 |-- StateHood: timestamp (nullable = true)

In [80]:
state.write.saveAsTable('state')

In [81]:
spark.sql('show tables').show()

+--------+---------+-----------+
|database|tableName|isTemporary|
+--------+---------+-----------+
| default|    sales|      false|
| default|    state|      false|
|        |  clients|       true|
|        |  tmpview|       true|
+--------+---------+-----------+

In [82]:
spark.sql('select * from state limit 5').toPandas()

,State,StateCode,Capital,LargestCity,PopulationEst2015,HouseSeats,StateHood
0,Alabama,AL,Montgomery,Birmingham,4858979,7,1819-12-14 00:07:58
1,Alaska,AK,Juneau,Anchorage,738432,1,1959-01-03 00:00:00
2,Arizona,AZ,Phoenix,Phoenix,6828065,9,1912-02-14 00:00:00
3,Arkansas,AR,Little Rock,Little Rock,2978204,4,1836-06-15 00:07:58
4,California,CA,Sacramento,Los Angeles,39144818,53,1850-09-09 00:07:58

In [84]:
statequery=spark.sql('''select i.StateCode, round(sum(s.SaleAmount)) as sales
                        from sales s join state i on s.State = i.State
                        group by i.StateCode''')

In [86]:
statequery.toPandas().tail()

   StateCode      sales
41        FL  1653074.0
42        CO   614704.0
43        AR   439497.0
44        OK   329649.0
45        UT   496737.0

___
### Machine Learning
* #### Data Preprocessing

In [87]:
import os

In [91]:
spark

In [92]:
from pyspark import SparkConf

In [101]:
spark.catalog.listTables()

[Table(name=u'sales', database=u'default', description=None, tableType=u'EXTERNAL', isTemporary=False),
 Table(name=u'state', database=u'default', description=None, tableType=u'MANAGED', isTemporary=False),
 Table(name=u'clients', database=None, description=None, tableType=u'TEMPORARY', isTemporary=True),
 Table(name=u'tmpview', database=None, description=None, tableType=u'TEMPORARY', isTemporary=True)]

In [100]:
spark.catalog.listDatabases()

[Database(name=u'default', description=u'default database', locationUri=u'file:/home/soyoung/newSparkJune2018/exerciseData/spark-warehouse')]

___

In [103]:
!pwd

/home/soyoung/newSparkJune2018/exerciseData

In [104]:
df3 = spark.read.csv('./cogsley_sales.csv', inferSchema=True, header=True)
df3.count()

8399

In [106]:
df3.cache()
df3=df3.dropna()
df3.count()

8399

In [118]:
df3.limit(3).toPandas()

,RowID,OrderID,OrderDate,OrderMonthYear,Quantity,Quote,DiscountPct,Rate,SaleAmount,CustomerName,CompanyName,Sector,Industry,City,ZipCode,State,Region,ProjectCompleteDate,DaystoComplete,ProductKey,ProductCategory,ProductSubCategory,Consultant,Manager,HourlyWage,RowCount,WageMargin
0,1,3,2010-10-13,2010-10-01,6,1200,0.04,200,1152.0,Muhammed MacIntyre,CA Inc.,Technology,Computer Software: Prepackaged Software,Highland Park,60035,Illinois,Central,2010-10-20,7,Development - Big Data,Development,Big Data,Ethan Bird,Josh Martinez,60,1,0.70
1,2,6,2012-02-20,2012-02-01,2,280,0.01,140,277.2,Ruben Staebel,Celgene Corporation,Health Care,Major Pharmaceuticals,Edmonds,98026,Washington,West,2012-02-21,1,Development - Front End Web,Development,Front End Web,Isabella Douglas,Bob Turner,75,1,0.46
2,3,32,2011-07-15,2011-07-01,26,3250,0.07,125,3022.5,Liz Greer,"Twenty-First Century Fox, Inc.",Consumer Services,Television Services,Elk Plain,98387,Washington,West,2011-07-17,2,Training - SQL,Training,SQL,Isabella Douglas,Bob Turner,75,1,0.40

___

In [130]:
summary = df3.select(["OrderMonthYear", 'SaleAmount'])\
.groupBy('OrderMonthYear').sum().orderBy("OrderMonthYear").toDF('OrderMonthYear','SaleAmount')
summary

DataFrame[OrderMonthYear: timestamp, SaleAmount: double]

In [135]:
summary.limit(3).show()

+-------------------+-----------------+
|     OrderMonthYear|       SaleAmount|
+-------------------+-----------------+
|2009-01-01 00:00:00|741024.2000000001|
|2009-02-01 00:00:00|544241.1499999998|
|2009-03-01 00:00:00|        563502.15|
+-------------------+-----------------+

In [140]:
from pyspark.sql import SQLContext

In [157]:
udf=lambda r: str(r).replace('-','')

In [170]:
summary.rdd.first()

Row(OrderMonthYear=datetime.datetime(2009, 1, 1, 0, 0), SaleAmount=741024.2000000001)

#### change data type

In [189]:
summary.withColumn('OrderMonthYear', summary.OrderMonthYear.cast('int')).show(3)

+--------------+-----------------+
|OrderMonthYear|       SaleAmount|
+--------------+-----------------+
|    1230786000|741024.2000000001|
|    1233464400|544241.1499999998|
|    1235883600|        563502.15|
+--------------+-----------------+
only showing top 3 rows

####  rdd map func

In [190]:
summary.rdd.map(lambda r: (str(r.OrderMonthYear).split()[0].replace('-',''), r.SaleAmount)).first()

('20090101', 741024.2000000001)

In [194]:
summary.rdd.map(lambda r: (str(r.OrderMonthYear).split()[0].replace('-',''), round(r.SaleAmount,2))).first()

('20090101', 741024.2)

In [196]:
summary.rdd.map(lambda r: (str(r.OrderMonthYear).split()[0].replace('-',''), round(r.SaleAmount,2))).toDF(['date','sales'])

DataFrame[date: string, sales: double]

In [217]:
result1 = summary.rdd\
    .map(lambda r: (str(r.OrderMonthYear).split()[0].replace('-',''), round(r.SaleAmount,2)))\
    .toDF(['date','sales'])
result1

DataFrame[date: string, sales: double]

In [223]:
result1.limit(3).toPandas()

       date      sales
0  20090101  741024.20
1  20090201  544241.15
2  20090301  563502.15

___
### spark2 
   * ### udf
     * can serve as map func

In [204]:
from pyspark.sql.functions import udf

In [209]:
myudf = udf(lambda x: int(str(x).split()[0].replace('-','')))

In [212]:
summary.withColumn('date', myudf('OrderMonthYear')).show(5)

+-------------------+-----------------+--------+
|     OrderMonthYear|       SaleAmount|    date|
+-------------------+-----------------+--------+
|2009-01-01 00:00:00|741024.2000000001|20090101|
|2009-02-01 00:00:00|544241.1499999998|20090201|
|2009-03-01 00:00:00|        563502.15|20090301|
|2009-04-01 00:00:00|619011.4000000001|20090401|
|2009-05-01 00:00:00|641158.6999999998|20090501|
+-------------------+-----------------+--------+
only showing top 5 rows

In [218]:
summary.select(myudf('OrderMonthYear').alias('date')).show(5)

+--------+
|    date|
+--------+
|20090101|
|20090201|
|20090301|
|20090401|
|20090501|
+--------+
only showing top 5 rows

In [222]:
result2 = summary.select(myudf('OrderMonthYear').alias('date'), \
                         udf(lambda r: round(r,2))('SaleAmount').alias('sales'))
result2

DataFrame[date: string, sales: string]

In [224]:
result2.limit(3).toPandas()

       date      sales
0  20090101   741024.2
1  20090201  544241.15
2  20090301  563502.15

___
### Convert DataFrame to Features and Labels

In [225]:
from pyspark.mllib.regression import LabeledPoint

___
* ### manually create data

In [230]:
from pyspark.ml.linalg import Vector
from pyspark.ml.feature import VectorAssembler
from pyspark.ml.feature import StringIndexer

In [232]:
df3.limit(3).toPandas()

,RowID,OrderID,OrderDate,OrderMonthYear,Quantity,Quote,DiscountPct,Rate,SaleAmount,CustomerName,CompanyName,Sector,Industry,City,ZipCode,State,Region,ProjectCompleteDate,DaystoComplete,ProductKey,ProductCategory,ProductSubCategory,Consultant,Manager,HourlyWage,RowCount,WageMargin
0,1,3,2010-10-13,2010-10-01,6,1200,0.04,200,1152.0,Muhammed MacIntyre,CA Inc.,Technology,Computer Software: Prepackaged Software,Highland Park,60035,Illinois,Central,2010-10-20,7,Development - Big Data,Development,Big Data,Ethan Bird,Josh Martinez,60,1,0.70
1,2,6,2012-02-20,2012-02-01,2,280,0.01,140,277.2,Ruben Staebel,Celgene Corporation,Health Care,Major Pharmaceuticals,Edmonds,98026,Washington,West,2012-02-21,1,Development - Front End Web,Development,Front End Web,Isabella Douglas,Bob Turner,75,1,0.46
2,3,32,2011-07-15,2011-07-01,26,3250,0.07,125,3022.5,Liz Greer,"Twenty-First Century Fox, Inc.",Consumer Services,Television Services,Elk Plain,98387,Washington,West,2011-07-17,2,Training - SQL,Training,SQL,Isabella Douglas,Bob Turner,75,1,0.40

* ###  label encoding

In [234]:
ind_sector = StringIndexer(inputCol='Sector', outputCol='Sector_cat')
ind_prodcat = StringIndexer(inputCol='ProductCategory', outputCol='ProductCategory_cat')
df4 = ind_sector.fit(df3).transform(df3)
df4 = ind_prodcat.fit(df4).transform(df4)
df4

DataFrame[RowID: int, OrderID: int, OrderDate: timestamp, OrderMonthYear: timestamp, Quantity: int, Quote: int, DiscountPct: double, Rate: int, SaleAmount: double, CustomerName: string, CompanyName: string, Sector: string, Industry: string, City: string, ZipCode: int, State: string, Region: string, ProjectCompleteDate: timestamp, DaystoComplete: int, ProductKey: string, ProductCategory: string, ProductSubCategory: string, Consultant: string, Manager: string, HourlyWage: int, RowCount: int, WageMargin: double, Sector_cat: double, ProductCategory_cat: double]

In [235]:
df4.limit(3).toPandas()

,RowID,OrderID,OrderDate,OrderMonthYear,Quantity,Quote,DiscountPct,Rate,SaleAmount,CustomerName,CompanyName,Sector,Industry,City,ZipCode,State,Region,ProjectCompleteDate,DaystoComplete,ProductKey,ProductCategory,ProductSubCategory,Consultant,Manager,HourlyWage,RowCount,WageMargin,Sector_cat,ProductCategory_cat
0,1,3,2010-10-13,2010-10-01,6,1200,0.04,200,1152.0,Muhammed MacIntyre,CA Inc.,Technology,Computer Software: Prepackaged Software,Highland Park,60035,Illinois,Central,2010-10-20,7,Development - Big Data,Development,Big Data,Ethan Bird,Josh Martinez,60,1,0.70,0.0,0.0
1,2,6,2012-02-20,2012-02-01,2,280,0.01,140,277.2,Ruben Staebel,Celgene Corporation,Health Care,Major Pharmaceuticals,Edmonds,98026,Washington,West,2012-02-21,1,Development - Front End Web,Development,Front End Web,Isabella Douglas,Bob Turner,75,1,0.46,2.0,0.0
2,3,32,2011-07-15,2011-07-01,26,3250,0.07,125,3022.5,Liz Greer,"Twenty-First Century Fox, Inc.",Consumer Services,Television Services,Elk Plain,98387,Washington,West,2011-07-17,2,Training - SQL,Training,SQL,Isabella Douglas,Bob Turner,75,1,0.40,1.0,2.0

In [237]:
print df4.columns

['RowID', 'OrderID', 'OrderDate', 'OrderMonthYear', 'Quantity', 'Quote', 'DiscountPct', 'Rate', 'SaleAmount', 'CustomerName', 'CompanyName', 'Sector', 'Industry', 'City', 'ZipCode', 'State', 'Region', 'ProjectCompleteDate', 'DaystoComplete', 'ProductKey', 'ProductCategory', 'ProductSubCategory', 'Consultant', 'Manager', 'HourlyWage', 'RowCount', 'WageMargin', 'Sector_cat', 'ProductCategory_cat']

In [239]:
df4.count(), result2.count()

(8399, 48)

In [255]:
df5 = df4.withColumn('Date', udf(lambda r: int(str(r).split()[0].replace('-','')))('OrderDate').cast('int'))
df5

DataFrame[RowID: int, OrderID: int, OrderDate: timestamp, OrderMonthYear: timestamp, Quantity: int, Quote: int, DiscountPct: double, Rate: int, SaleAmount: double, CustomerName: string, CompanyName: string, Sector: string, Industry: string, City: string, ZipCode: int, State: string, Region: string, ProjectCompleteDate: timestamp, DaystoComplete: int, ProductKey: string, ProductCategory: string, ProductSubCategory: string, Consultant: string, Manager: string, HourlyWage: int, RowCount: int, WageMargin: double, Sector_cat: double, ProductCategory_cat: double, Date: int]

In [256]:
df5.limit(3).toPandas()

,RowID,OrderID,OrderDate,OrderMonthYear,Quantity,Quote,DiscountPct,Rate,SaleAmount,CustomerName,CompanyName,Sector,Industry,City,ZipCode,State,Region,ProjectCompleteDate,DaystoComplete,ProductKey,ProductCategory,ProductSubCategory,Consultant,Manager,HourlyWage,RowCount,WageMargin,Sector_cat,ProductCategory_cat,Date
0,1,3,2010-10-13,2010-10-01,6,1200,0.04,200,1152.0,Muhammed MacIntyre,CA Inc.,Technology,Computer Software: Prepackaged Software,Highland Park,60035,Illinois,Central,2010-10-20,7,Development - Big Data,Development,Big Data,Ethan Bird,Josh Martinez,60,1,0.70,0.0,0.0,20101013
1,2,6,2012-02-20,2012-02-01,2,280,0.01,140,277.2,Ruben Staebel,Celgene Corporation,Health Care,Major Pharmaceuticals,Edmonds,98026,Washington,West,2012-02-21,1,Development - Front End Web,Development,Front End Web,Isabella Douglas,Bob Turner,75,1,0.46,2.0,0.0,20120220
2,3,32,2011-07-15,2011-07-01,26,3250,0.07,125,3022.5,Liz Greer,"Twenty-First Century Fox, Inc.",Consumer Services,Television Services,Elk Plain,98387,Washington,West,2011-07-17,2,Training - SQL,Training,SQL,Isabella Douglas,Bob Turner,75,1,0.40,1.0,2.0,20110715

In [258]:
ass = VectorAssembler(inputCols=['Quantity','Quote','DiscountPct','Rate','HourlyWage','Sector_cat','ProductCategory_cat','Date']
                     , outputCol='features')
ass

VectorAssembler_40c4812aad8581232349

In [259]:
output=ass.transform(df5)
output

DataFrame[RowID: int, OrderID: int, OrderDate: timestamp, OrderMonthYear: timestamp, Quantity: int, Quote: int, DiscountPct: double, Rate: int, SaleAmount: double, CustomerName: string, CompanyName: string, Sector: string, Industry: string, City: string, ZipCode: int, State: string, Region: string, ProjectCompleteDate: timestamp, DaystoComplete: int, ProductKey: string, ProductCategory: string, ProductSubCategory: string, Consultant: string, Manager: string, HourlyWage: int, RowCount: int, WageMargin: double, Sector_cat: double, ProductCategory_cat: double, Date: int, features: vector]

In [263]:
output.limit(3).select('features','SaleAmount').toPandas()

                                            features  SaleAmount
0  [6.0, 1200.0, 0.04, 200.0, 60.0, 0.0, 0.0, 201...      1152.0
1  [2.0, 280.0, 0.01, 140.0, 75.0, 2.0, 0.0, 2012...       277.2
2  [26.0, 3250.0, 0.07, 125.0, 75.0, 1.0, 2.0, 20...      3022.5

* change column name

In [266]:
from pyspark.sql.functions import col

In [267]:
output.limit(3).select('features', col('SaleAmount').alias('sales')).toPandas()

                                            features   sales
0  [6.0, 1200.0, 0.04, 200.0, 60.0, 0.0, 0.0, 201...  1152.0
1  [2.0, 280.0, 0.01, 140.0, 75.0, 2.0, 0.0, 2012...   277.2
2  [26.0, 3250.0, 0.07, 125.0, 75.0, 1.0, 2.0, 20...  3022.5

___

In [269]:
train, test = output.select(['features',col('SaleAmount').alias('sales')]).randomSplit([0.7, 0.3])
train.count(), test.count()

(5848, 2551)

In [271]:
train.describe().show()

+-------+-----------------+
|summary|            sales|
+-------+-----------------+
|  count|             5848|
|   mean|3463.255001709985|
| stddev|2074.125404385261|
|    min|             99.0|
|    max|           9900.0|
+-------+-----------------+

### Linear Regression

In [272]:
from pyspark.ml.regression import LinearRegression

In [330]:
lr = LinearRegression(labelCol='sales', regParam=0, elasticNetParam=0.5)
lr

LinearRegression_4840b223e53f737fddeb

In [331]:
%%time
train_model = lr.fit(train, {lr.regParam:1})

CPU times: user 24 ms, sys: 8 ms, total: 32 ms
Wall time: 1.44 s

In [332]:
model_results = train_model.evaluate(test)
model_results

In [333]:
model_results.r2, model_results.rootMeanSquaredError

(0.9988844543410129, 70.5595129084564)

In [283]:
train_model.summary.predictions.describe().show()

+-------+-----------------+------------------+
|summary|            sales|        prediction|
+-------+-----------------+------------------+
|  count|             5848|              5848|
|   mean|3463.255001709985|3463.2550017099793|
| stddev|2074.125404385261|2072.9412274685274|
|    min|             99.0|-314.7971127491278|
|    max|           9900.0| 9651.274433369581|
+-------+-----------------+------------------+

___

### Streaming

In [334]:
from pyspark.sql.functions import explode, split

In [339]:
from pyspark.sql import Row

In [349]:
mock = spark.createDataFrame([(1,2,'3 6'),(99,66,'77 666')], ['a','B','c'])
mock.show()

+---+---+------+
|  a|  B|     c|
+---+---+------+
|  1|  2|   3 6|
| 99| 66|77 666|
+---+---+------+

* ### split

In [361]:
mock.select(split(mock.c, ' ').alias('splited')).show()

+---------+
|  splited|
+---------+
|   [3, 6]|
|[77, 666]|
+---------+

* ### explode

In [364]:
mock.select(explode(split(mock.c, ' '))).show()

+---+
|col|
+---+
|  3|
|  6|
| 77|
|666|
+---+